Core/src/src/Reports/РасчетныеЛисткиИТабельСОтправкой/РасчетныеЛисткиИТабельСОтправкой.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РасчетныеЛисткиИТабельСОтправкой</name>
  <attributes>
    <name>ЭтоОтчетУНФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

Core/src/src/AccumulationRegisters/НачисленияИУдержания/НачисленияИУдержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НачисленияИУдержания</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтработаноДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтработаноЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНачисленияУдержания</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyЗаказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчастникПенсионногоФонда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетДобровольно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/InformationRegisters/ФИОФизЛиц/ФИОФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОФизЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/InformationRegisters/ОтправкаОтчетаНаЭлектроннуюПочту/ОтправкаОтчетаНаЭлектроннуюПочту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтправкаОтчетаНаЭлектроннуюПочту</name>
  <resources>
    <name>ВложеныйФайл</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ПолучательМейл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/Documents/ПлатежнаяВедомость/ПлатежнаяВедомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлатежнаяВедомость</name>
  <posting>Deny</posting>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаРасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПлатежнаяВедомость</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьГлавногоБухгалтера</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДФЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyДокументОснование</name>
    <type>
      <types>DocumentRef.НачислениеЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасчетов</name>
    <comment>ONESOFT-3523</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛРасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторВИнтернетБанке</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПФПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияНДФЛ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияПФ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЛгот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <comment>ONESOFT-3849</comment>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/Reports/РасчетныеЛисткиИТабельСОтправкой/Forms/ФормаОтчета/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
// Функция формирует и выполняет запрос.
//
Функция ВыполнитьЗапрос()
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НачисленияИУдержания.Сотрудник КАК Физлицо,
	|	НачисленияИУдержания.Сотрудник.Код КАК ТабельныйНомер,
	|	НачисленияИУдержания.СтруктурнаяЕдиница КАК Подразделение,
	|	НачисленияИУдержания.СтруктурнаяЕдиница.Наименование КАК ПодразделениеПредставление,
	// Олег Литвиненко 29.06.23 --->
	|	ВЫБОР
	|		КОГДА НачисленияИУдержания.Валюта.СимвольноеПредставление = """"
	|			ТОГДА НачисленияИУдержания.Валюта
	|		ИНАЧЕ НачисленияИУдержания.Валюта.СимвольноеПредставление
	|	КОНЕЦ КАК ВалютаПредставление,	
	|	НачисленияИУдержания.Валюта КАК Валюта,	
	|	ЕСТЬNULL(КурсыВалют.Курс, 1) КАК Курс,
	|	КурсыВалют.Период КАК ДатаКурса,
	// Олег Литвиненко <---
	|	СотрудникиСрезПоследних.Должность КАК Должность,
	|	ВЫБОР
	|		КОГДА НачисленияИУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|			ТОГДА НачисленияИУдержания.ВидНачисленияУдержания
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Начисление,
	|	ВЫБОР
	|		КОГДА НачисленияИУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|			ТОГДА NULL
	|		ИНАЧЕ НачисленияИУдержания.ВидНачисленияУдержания
	|	КОНЕЦ КАК Удержание,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияИУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|				ТОГДА ЕСТЬNULL(НачисленияИУдержания.Сумма, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНачислено,
	// Олег Литвиненко 29.06.23 --->
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияИУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|				ТОГДА ЕСТЬNULL(НачисленияИУдержания.СуммаВал, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНачисленоВал,
	// Олег Литвиненко <---
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияИУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(НачисленияИУдержания.Сумма, 0)
	|		КОНЕЦ) КАК СуммаУдержано,
	// Олег Литвиненко 29.06.23 --->
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияИУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(НачисленияИУдержания.СуммаВал, 0)
	|		КОНЕЦ) КАК СуммаУдержаноВал,	
	// Олег Литвиненко <---
	|	ВЫБОР
	|		КОГДА НачисленияИУдержания.ВидНачисленияУдержания = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплата)
	|				ИЛИ НачисленияИУдержания.ВидНачисленияУдержания = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплатаПроцент)
	|			ТОГДА &ПериодРегистрации
	|		ИНАЧЕ НачисленияИУдержания.ДатаНачала
	|	КОНЕЦ КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА НачисленияИУдержания.ВидНачисленияУдержания = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплата)
	|				ИЛИ НачисленияИУдержания.ВидНачисленияУдержания = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплатаПроцент)
	|			ТОГДА КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
	|		ИНАЧЕ НачисленияИУдержания.ДатаОкончания
	|	КОНЕЦ КАК ДатаОкончания,
	|	СУММА(НачисленияИУдержания.ОтработаноДней) КАК ОтработаноДней,
	|	СУММА(НачисленияИУдержания.ОтработаноЧасов) КАК ОтработаноЧасов,
	|	ЕСТЬNULL(ДолгНаКонец.СуммаОстаток, 0) КАК СальдоНаКонец,
	|	ЕСТЬNULL(ДолгНаНачало.СуммаОстаток, 0) КАК СальдоНаНачало,
	// Олег Литвиненко 29.06.23 --->
	|	ЕСТЬNULL(ДолгНаКонец.СуммаВалОстаток, 0) КАК СальдоНаКонецВал,
	|	ЕСТЬNULL(ДолгНаНачало.СуммаВалОстаток, 0) КАК СальдоНаНачалоВал,	
	// Олег Литвиненко <---
	|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия, """") <> """"
	|			ТОГДА ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество
	|		ИНАЧЕ НачисленияИУдержания.Сотрудник.Наименование
	|	КОНЕЦ КАК СотрудникПредставление
	|ИЗ
	|	РегистрНакопления.НачисленияИУдержания КАК НачисленияИУдержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПерсоналом.Остатки(
	|				&ПериодРегистрации,
	|				Организация = &Организация
	|					И Валюта = &Валюта
	|					" + ?(НЕ ЗначениеЗаполнено(Подразделение), "", "И СтруктурнаяЕдиница = &Подразделение") + ") КАК ДолгНаНачало
	|		ПО НачисленияИУдержания.Сотрудник = ДолгНаНачало.Сотрудник
	|			И НачисленияИУдержания.СтруктурнаяЕдиница = ДолгНаНачало.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПерсоналом.Остатки(
	|				&ПериодРегистрацииКонец,
	|				Организация = &Организация
	|					И Валюта = &Валюта
	|					" + ?(НЕ ЗначениеЗаполнено(Подразделение), "", "И СтруктурнаяЕдиница = &Подразделение") + ") КАК ДолгНаКонец
	|		ПО НачисленияИУдержания.Сотрудник = ДолгНаКонец.Сотрудник
	|			И НачисленияИУдержания.СтруктурнаяЕдиница = ДолгНаКонец.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПоследних(
	|				&ПериодРегистрацииКонец,
	|				Организация = &Организация
	|					И СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) КАК СотрудникиСрезПоследних
	|		ПО НачисленияИУдержания.Сотрудник = СотрудникиСрезПоследних.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ПериодРегистрацииКонец, ) КАК ФИОФизЛицСрезПоследних
	|		ПО НачисленияИУдержания.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ПериодРегистрацииКонец, ) КАК КурсыВалют	
	|		ПО НачисленияИУдержания.Валюта = КурсыВалют.Валюта
	|ГДЕ
	|	НачисленияИУдержания.Организация = &Организация
	|	И НачисленияИУдержания.ПериодРегистрации = &ПериодРегистрации
	|	И НачисленияИУдержания.Валюта = &Валюта" + ?(НЕ ЗначениеЗаполнено(Подразделение), "", "
	|	И НачисленияИУдержания.СтруктурнаяЕдиница = &Подразделение") + " " + ?(НЕ ЗначениеЗаполнено(Сотрудник), "", "
	|	И НачисленияИУдержания.Сотрудник = &Сотрудник") + "
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияИУдержания.Сотрудник.Код,
	|	ВЫБОР
	|		КОГДА НачисленияИУдержания.ВидНачисленияУдержания = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплата)
	|				ИЛИ НачисленияИУдержания.ВидНачисленияУдержания = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплатаПроцент)
	|			ТОГДА &ПериодРегистрации
	|		ИНАЧЕ НачисленияИУдержания.ДатаНачала
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияИУдержания.ВидНачисленияУдержания = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплата)
	|				ИЛИ НачисленияИУдержания.ВидНачисленияУдержания = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.СдельнаяОплатаПроцент)
	|			ТОГДА КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
	|		ИНАЧЕ НачисленияИУдержания.ДатаОкончания
	|	КОНЕЦ,
	|	НачисленияИУдержания.Сотрудник,
	|	НачисленияИУдержания.СтруктурнаяЕдиница,
	|	НачисленияИУдержания.СтруктурнаяЕдиница.Наименование,
	|	СотрудникиСрезПоследних.Должность,
	|	ЕСТЬNULL(ДолгНаКонец.СуммаОстаток, 0),
	|	ЕСТЬNULL(ДолгНаНачало.СуммаОстаток, 0),
	// Олег Литвиненко 29.06.23 --->
	|	НачисленияИУдержания.Валюта,
	|	ЕСТЬNULL(ДолгНаКонец.СуммаВалОстаток, 0),
	|	ЕСТЬNULL(ДолгНаНачало.СуммаВалОстаток, 0),
	|	ЕСТЬNULL(КурсыВалют.Курс, 1),
	|	КурсыВалют.Период,
	// Олег Литвиненко <---
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	ВЫБОР
	|		КОГДА НачисленияИУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|			ТОГДА НачисленияИУдержания.ВидНачисленияУдержания
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НачисленияИУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|			ТОГДА NULL
	|		ИНАЧЕ НачисленияИУдержания.ВидНачисленияУдержания
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия, """") <> """"
	|			ТОГДА ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество
	|		ИНАЧЕ НачисленияИУдержания.Сотрудник.Наименование
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеПредставление,
	|	СотрудникПредставление,
	|	ДатаНачала
	|ИТОГИ
	|	МАКСИМУМ(ПодразделениеПредставление),
	// Олег Литвиненко 29.06.23 --->
	|	МАКСИМУМ(ВалютаПредставление),
	|	МАКСИМУМ(Валюта),
	|	МАКСИМУМ(Курс),
	|	МАКСИМУМ(ДатаКурса),
	|	СУММА(СуммаНачисленоВал),
	|	СУММА(СуммаУдержаноВал),
	// Олег Литвиненко <---
	|	МАКСИМУМ(Должность),
	|	СУММА(СуммаНачислено),
	|	СУММА(СуммаУдержано),
	|	МАКСИМУМ(СальдоНаКонец),
	|	МАКСИМУМ(СальдоНаНачало),
	|	МАКСИМУМ(Фамилия),
	|	МАКСИМУМ(Имя),
	|	МАКСИМУМ(Отчество)
	|ПО
	|	Подразделение,
	|	Физлицо
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РасчетыСПерсоналомОбороты.Регистратор ССЫЛКА Документ.РасходИзКассы
	|			ТОГДА ""Через кассу ""
	|		ИНАЧЕ ""С расч. счета ""
	|	КОНЕЦ КАК ПредставлениеДокумента,
	|	ВЫБОР
	|		КОГДА РасчетыСПерсоналомОбороты.Регистратор.ДокументОснование ССЫЛКА Документ.ПлатежнаяВедомость
	|				И РасчетыСПерсоналомОбороты.Регистратор.ДокументОснование.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежнаяВедомость.Аванс)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПризнакАванса,
	|	РасчетыСПерсоналомОбороты.Регистратор.Номер КАк Номер,
	|	РасчетыСПерсоналомОбороты.Регистратор.Дата КАК Дата,
	|	РасчетыСПерсоналомОбороты.Регистратор,
	|	РасчетыСПерсоналомОбороты.Сотрудник,
	|	РасчетыСПерсоналомОбороты.СуммаРасход КАК СуммаВыплаты,
	|	РасчетыСПерсоналомОбороты.СуммаВалРасход КАК СуммаВыплатыВал
	|ИЗ
	|	РегистрНакопления.РасчетыСПерсоналом.Обороты(
	|			&ПериодРегистрации,
	|			&ПериодРегистрацииКонец,
	|			Запись,
	|			Организация = &Организация
	|				И Валюта = &Валюта" + ?(НЕ ЗначениеЗаполнено(Подразделение), "", "
	|				И СтруктурнаяЕдиница = &Подразделение") + " " + ?(НЕ ЗначениеЗаполнено(Сотрудник), "", "
	|				И Сотрудник = &Сотрудник") + ") КАК РасчетыСПерсоналомОбороты
	|ГДЕ
	|	(РасчетыСПерсоналомОбороты.Регистратор ССЫЛКА Документ.РасходИзКассы
	|			ИЛИ РасчетыСПерсоналомОбороты.Регистратор ССЫЛКА Документ.РасходСоСчета)
    |
	|УПОРЯДОЧИТЬ ПО
	|	РасчетыСПерсоналомОбороты.Регистратор.ДокументОснование.Дата,
	|	РасчетыСПерсоналомОбороты.Регистратор.Дата
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабельОбороты.СтруктурнаяЕдиница КАК Подразделение,
	|	ТабельОбороты.Должность КАК Должность,
	|	ТабельОбороты.Сотрудник КАК ФизЛицо,
	|	ТабельОбороты.ВидВремени КАК ВидВремени,
	|	ТабельОбороты.ДнейОборот КАК Количество
	|ИЗ
	|	РегистрНакопления.Табель.Обороты(
	|			&ПериодРегистрации,
	|			&ПериодРегистрацииКонец,
	|			,
	|			Организация = &Организация
	|				И ВЫБОР
	|					КОГДА &Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ СтруктурнаяЕдиница = &Подразделение
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Сотрудник = &Сотрудник
	|				КОНЕЦ) КАК ТабельОбороты";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("ПериодРегистрацииКонец", КонецМесяца(ПериодРегистрации)); 
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ВидДоговораДоговорЗайма", Перечисления.ВидыДоговоровКредитаИЗайма.ДоговорЗаймаСотруднику);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатЗапроса;

КонецФункции // ВыполнитьЗапрос()

&НаСервере
// Процедура формирует отчет.
//
Процедура СформироватьВыполнить()

	Если Константы.ИспользоватьНесколькоОрганизаций.Получить() И НЕ ЗначениеЗаполнено(Организация) Тогда
		ТекстСообщения = НСтр("ka='Не выбрана организация!';ru='Не выбрана организация!';en='Not selected organization!'");
		ПолеСообщения = "Организация";
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Отчет, ТекстСообщения,,,ПолеСообщения);
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ПериодРегистрации) Тогда
		ТекстСообщения = НСтр("ka='Не выбран период регистрации!';ru='Не выбран период регистрации!';en='Not selected registration period!'");
		ПолеСообщения = "ПериодРегистрации";
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Отчет, ТекстСообщения,,,ПолеСообщения);
		Возврат;
	КонецЕсли;

	Если НЕ Константы.ФункциональнаяУчетВалютныхОпераций.Получить() И НЕ ЗначениеЗаполнено(Валюта) Тогда
		ТекстСообщения = НСтр("ka='Не выбрана валюта!';ru='Не выбрана валюта!';en='Not selected currency!'");
		ПолеСообщения = "Валюта";
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Отчет, ТекстСообщения,,,ПолеСообщения);
		Возврат;
	КонецЕсли;

	
	//Макет = Отчеты.РасчетныеЛисткиСОтправкой.ПолучитьМакет("Макет");
	ТабличныйДокумент = ПолучитьТабДок();	

КонецПроцедуры // Сформировать()

&НаСервере
Функция ПолучитьТабДок()

	ТабДок = Новый ТабличныйДокумент;
	
	РезультатЗапроса = ВыполнитьЗапрос();

	Если РезультатЗапроса[0].Пустой() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='Нет данных для формирования отчета!';ru='Нет данных для формирования отчета!';en='No data to generate a report!'");
		Сообщение.Сообщить();
		Возврат ТабДок;
	КонецЕсли;
	
	// Олег Литвиненко 29.06.23 --->
	ЭтотОтчет = РеквизитФормыВЗначение("Отчет");
	Макет = ЭтотОтчет.ПолучитьМакет("Макет"); 

	РегВалюта = Константы.НациональнаяВалюта.Получить();
	// Олег Литвиненко <---
	
	ОбластьШапка 				= Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовок 			= Макет.ПолучитьОбласть("Заголовок");
	ОбластьНачисленоУдержано 	= Макет.ПолучитьОбласть("НачисленоУдержано");
	ОбластьДетали 				= Макет.ПолучитьОбласть("Детали");
	ОбластьДоходыВыплачено 		= Макет.ПолучитьОбласть("ДоходыВыплачено");
	ОбластьДеталиВыплаты 		= Макет.ПолучитьОбласть("ДеталиВыплаты");
	ОбластьВсего 				= Макет.ПолучитьОбласть("Всего");
	// Олег Литвиненко 29.06.23 --->
	ОбластьВсегоВал				= Макет.ПолучитьОбласть("ВсегоВал");
	ОбластьВремяШапка			= Макет.ПолучитьОбласть("РабочееВремяШапка");
	ОбластьВремяСтрока			= Макет.ПолучитьОбласть("РабочееВремяСтрока");
	// Олег Литвиненко <---
	ОбластьПодвал 				= Макет.ПолучитьОбласть("Подвал");
	ОбластьОтбивка 				= Макет.ПолучитьОбласть("Отбивка");

	ТабДок.Очистить();

    ОбластьОтбивка.Параметры.ТекстОтбивки = Формат(ПериодРегистрации , "ДФ=""ММММ гггг 'г.' """);
	ТабДок.Вывести(ОбластьОтбивка);

	// Олег Литвиненко 29.06.23 --->
	ТаблицаТабель = РезультатЗапроса[2].Выгрузить();
	СтруктураОтбораТабель = Новый Структура("Подразделение,Должность,ФизЛицо");
	// Олег Литвиненко <---
	
    ОбластьОтбивка.Параметры.ТекстОтбивки = "Организация: " + Организация;
	ТабДок.Вывести(ОбластьОтбивка);

	ВыборкаПодразделение = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
	Пока ВыборкаПодразделение.Следующий() Цикл

        ОбластьОтбивка.Параметры.ТекстОтбивки = "Подразделение: " + ВыборкаПодразделение.Подразделение;
		ТабДок.Вывести(ОбластьОтбивка);
        ТабДок.НачатьГруппуСтрок();
		
		ВыборкаФизлицо = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ФизЛицо");
		Пока ВыборкаФизлицо.Следующий() Цикл

			ОбластьШапка.Параметры.Заголовок = "Расчетный листок за " + Формат(ПериодРегистрации , "ДФ=""ММММ гггг 'г.' """);
			ОбластьШапка.Параметры.Организация = Организация;
			ОбластьШапка.Параметры.Заполнить(ВыборкаФизлицо);
			ОбластьШапка.Параметры.ДатаКурса = Формат(ВыборкаФизлицо.ДатаКурса, "ДФ=dd.MM.yy");
			ПредставлениеФизЛицо = УправлениеНебольшойФирмойСервер.ПолучитьФамилиюИмяОтчество(ВыборкаФизлицо.Фамилия, ВыборкаФизлицо.Имя, ВыборкаФизлицо.Отчество, Истина);
			ОбластьШапка.Параметры.ФизЛицо = ВыборкаФизлицо.Физлицо.НаименованиеНаИностранскомЯзыке;//Физлицо.НаименованиеАнглиское;//?(ЗначениеЗаполнено(ПредставлениеФизЛицо), ПредставлениеФизЛицо, ВыборкаФизлицо.Физлицо);
			ТабДок.Вывести(ОбластьШапка);
			ТабДок.Вывести(ОбластьЗаголовок);
			ТабДок.Вывести(ОбластьНачисленоУдержано);

			ПоследнееНачисление = ТабДок.ВысотаТаблицы;
			ПоследнееУдержание = ТабДок.ВысотаТаблицы;
			
			ВыборкаДетали = ВыборкаФизлицо.Выбрать();
			Пока ВыборкаДетали.Следующий() Цикл
			
				Если ВыборкаДетали.Удержание = NULL Тогда
					
					Если ПоследнееНачисление < ПоследнееУдержание Тогда
						
						ТабДок.Область(ПоследнееНачисление + 1, 1).Текст = ВыборкаДетали.Начисление;
						ТабДок.Область(ПоследнееНачисление + 1, 2, ПоследнееНачисление + 1, 3).Текст = "" + День(ВыборкаДетали.ДатаНачала) + "-" + День(ВыборкаДетали.ДатаОкончания) + " " + Формат(ВыборкаДетали.ДатаОкончания , "ДФ=""МММ гг""");
						ТабДок.Область(ПоследнееНачисление + 1, 4).Текст = ВыборкаДетали.ОтработаноДней;
						ТабДок.Область(ПоследнееНачисление + 1, 5).Текст = ВыборкаДетали.ОтработаноЧасов;
						//ТабДок.Область(ПоследнееНачисление + 1, 6, ПоследнееНачисление + 1, 7).Текст = ВыборкаДетали.СуммаНачислено;
						// Олег Литвиненко 17.08.23 --->
						ТабДок.Область(ПоследнееНачисление + 1, 6, ПоследнееНачисление + 1, 7).Текст = ?(ВыборкаДетали.Валюта=РегВалюта, ВыборкаДетали.СуммаНачислено, ВыборкаДетали.СуммаНачисленоВал);
						// Олег Литвиненко <---
					
					Иначе
					
						ОбластьДетали.Параметры.Начисление = СтрШаблон("%1, %2", ВыборкаДетали.Начисление, ВыборкаДетали.ВалютаПредставление);
						ОбластьДетали.Параметры.ПериодНачисление = "" + День(ВыборкаДетали.ДатаНачала) + "-" + День(ВыборкаДетали.ДатаОкончания) + " " + Формат(ВыборкаДетали.ДатаОкончания , "ДФ=""МММ гг""");
						ОбластьДетали.Параметры.ОтработаноДнейНачисление = ВыборкаДетали.ОтработаноДней;
						ОбластьДетали.Параметры.ОтработаноЧасовНачисление = ВыборкаДетали.ОтработаноЧасов;
						ОбластьДетали.Параметры.СуммаНачислениеВал = ВыборкаДетали.СуммаНачисленоВал;
						
						ТабДок.Вывести(ОбластьДетали);
						
						ОбластьДетали.Параметры.Начисление = Справочники.ВидыНачисленийИУдержаний.ПустаяСсылка();
						ОбластьДетали.Параметры.ПериодНачисление = "";
						ОбластьДетали.Параметры.ОтработаноДнейНачисление = 0;
						ОбластьДетали.Параметры.ОтработаноЧасовНачисление = 0;
						ОбластьДетали.Параметры.СуммаНачислениеВал = 0;
					
					КонецЕсли; 
					
					ПоследнееНачисление = ПоследнееНачисление + 1;
				
				Иначе
					
					Если ПоследнееУдержание < ПоследнееНачисление Тогда
					
						ТабДок.Область(ПоследнееУдержание + 1, 8, ПоследнееУдержание + 1, 10).Текст = ВыборкаДетали.Удержание;	
						ТабДок.Область(ПоследнееУдержание + 1, 11, ПоследнееУдержание + 1, 12).Текст = "" + День(ВыборкаДетали.ДатаНачала) + "-" + День(ВыборкаДетали.ДатаОкончания) + " " + Формат(ВыборкаДетали.ДатаОкончания , "ДФ=""МММ гг""");
						ТабДок.Область(ПоследнееУдержание + 1, 13, ПоследнееУдержание + 1, 14).Текст = ВыборкаДетали.СуммаУдержано;
					
					Иначе
					
						ОбластьДетали.Параметры.Удержание = ВыборкаДетали.Удержание;
						ОбластьДетали.Параметры.ПериодУдержание = "" + День(ВыборкаДетали.ДатаНачала) + "-" + День(ВыборкаДетали.ДатаОкончания) + " " + Формат(ВыборкаДетали.ДатаОкончания , "ДФ=""МММ гг""");
						ОбластьДетали.Параметры.СуммаУдержаниеВал = ВыборкаДетали.СуммаУдержаноВал;
						// Олег Литвиненко 14.08.23 --->
						ОбластьДетали.Параметры.Валюта = ВыборкаДетали.Валюта;
						// Олег Литвиненко <---
						
						ТабДок.Вывести(ОбластьДетали);
						
						ОбластьДетали.Параметры.Удержание = Справочники.ВидыНачисленийИУдержаний.ПустаяСсылка();
						ОбластьДетали.Параметры.ПериодУдержание = "";
						ОбластьДетали.Параметры.СуммаУдержаниеВал = 0;
					
					КонецЕсли; 
					
					ПоследнееУдержание = ПоследнееУдержание + 1;
				
				КонецЕсли; 
		
			КонецЦикла;

			ОбластьВсего.Параметры.ВсегоНачисления = ВыборкаФизлицо.СуммаНачислено;
			ОбластьВсего.Параметры.ВсегоУдержания = ВыборкаФизлицо.СуммаУдержано;
			// Олег Литвиненко 29.06.23 --->
			ОбластьВсегоВал.Параметры.Валюта = ВыборкаФизлицо.ВалютаПредставление;
			ОбластьВсегоВал.Параметры.ВсегоНачисленияВал = ВыборкаФизлицо.СуммаНачисленоВал;
			//ОбластьВсегоВал.Параметры.ВсегоУдержанияВал = ВыборкаФизлицо.СуммаУдержаноВал;
			Если Не ВыборкаФизлицо.Валюта = РегВалюта Тогда
				ТабДок.Вывести(ОбластьВсегоВал);
			КонецЕсли;
			// Олег Литвиненко <---
			ТабДок.Вывести(ОбластьВсего);
			
			Если Ложь Тогда // Выключено по просьбе Giorgi Sigua
				ТабДок.Вывести(ОбластьДоходыВыплачено);
				ВыборкаВыплатСотрудника		= РезультатЗапроса[1].Выбрать();
				
				СтруктураПоискиПоВыборкей	= Новый Структура("Сотрудник", ВыборкаФизлицо.Физлицо);
				Пока ВыборкаВыплатСотрудника.НАйтиСледующий(СтруктураПоискиПоВыборкей) Цикл
					
					//ОбластьДеталиВыплаты.Параметры.Заполнить(ВыборкаВыплатСотрудника);
					// Олег Литвиненко 29.06.23 --->
					Если Не РегВалюта = ВыборкаФизлицо.Валюта Тогда
						ОбластьДеталиВыплаты.Параметры.СуммаВыплаты	= ВыборкаВыплатСотрудника.СуммаВыплатыВал;
					
						ОбластьДеталиВыплаты.Параметры.ТекстВыплаты = "" + ВыборкаВыплатСотрудника.ПредставлениеДокумента + ?(ВыборкаВыплатСотрудника.ПризнакАванса, "(аванс) №", " №") + 
																		СокрЛП(ВыборкаВыплатСотрудника.Номер) + " от " + Формат(ВыборкаВыплатСотрудника.Дата, "ДФ=dd.MM.yyyy") + ", "+ ВыборкаФизлицо.ВалютаПредставление;
						ОбластьДеталиВыплаты.Параметры.ПериодВыплат		= "" + День(ПериодРегистрации) + "-" + День(КонецМесяца(ПериодРегистрации)) + " " + Формат(КонецМесяца(ПериодРегистрации) , "ДФ=""МММ гг""");
						
						ТабДок.Вывести(ОбластьДеталиВыплаты);
					КонецЕсли;
					// Олег Литвиненко <---
					
					ОбластьДеталиВыплаты.Параметры.СуммаВыплаты	= ВыборкаВыплатСотрудника.СуммаВыплаты;
					
					ОбластьДеталиВыплаты.Параметры.ТекстВыплаты = "" + ВыборкаВыплатСотрудника.ПредставлениеДокумента + ?(ВыборкаВыплатСотрудника.ПризнакАванса, "(аванс) №", " №") + 
																	СокрЛП(ВыборкаВыплатСотрудника.Номер) + " от " + Формат(ВыборкаВыплатСотрудника.Дата, "ДФ=dd.MM.yyyy") + ", "+ РегВалюта;
					ОбластьДеталиВыплаты.Параметры.ПериодВыплат		= "" + День(ПериодРегистрации) + "-" + День(КонецМесяца(ПериодРегистрации)) + " " + Формат(КонецМесяца(ПериодРегистрации) , "ДФ=""МММ гг""");
					
					ТабДок.Вывести(ОбластьДеталиВыплаты);
					
				КонецЦикла;
				
				ОбластьПодвал.Параметры.СуммаДолгНаНачалоПериода = ВыборкаФизлицо.СальдоНаНачало;
				Если ВыборкаФизлицо.СальдоНаНачало < 0 Тогда
					ОбластьПодвал.Параметры.ТекстДолгНаНачалоПериода = "Долг за работником на начало месяца:";
				Иначе	
					ОбластьПодвал.Параметры.ТекстДолгНаНачалоПериода = "Долг за организацией на начало месяца:";
				КонецЕсли; 
				
			КонецЕсли;
			
			ОбластьПодвал.Параметры.СуммаДолгНаКонецПериода = ВыборкаФизлицо.СальдоНаКонец;
			Если ВыборкаФизлицо.СальдоНаКонец < 0 Тогда
				ОбластьПодвал.Параметры.ТекстДолгНаКонецПериода = "Долг за работником на конец месяца:";
			Иначе	
				ОбластьПодвал.Параметры.ТекстДолгНаКонецПериода = "Долг за организацией на конец месяца:";
			КонецЕсли; 
			ТабДок.Вывести(ОбластьПодвал);
				
			Если Ложь Тогда // Выключено по просьбе Giorgi Sigua
				// Олег Литвиненко 29.06.23 --->
				ЗаполнитьЗначенияСвойств(СтруктураОтбораТабель, ВыборкаФизлицо);
				МассивСтрокТабеля = ТаблицаТабель.НайтиСтроки(СтруктураОтбораТабель);
				Если МассивСтрокТабеля.Количество()>0 Тогда
					ТабДок.Вывести(ОбластьВремяШапка);
					Для Каждого ТекСтр Из МассивСтрокТабеля Цикл
						ОбластьВремяСтрока.Параметры.Заполнить(ТекСтр);
						ТабДок.Вывести(ОбластьВремяСтрока);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			// Олег Литвиненко <---
		КонецЦикла;

        ТабДок.ЗакончитьГруппуСтрок();
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
// Процедура - обработчик команды Сформировать.
//
Процедура Сформировать(Команда)
	
	СформироватьВыполнить();
	
КонецПроцедуры

 
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура - обработчик события формы ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодРегистрации 				= НачалоМесяца(ТекущаяДата());
	ОтображениеПериодаРегистрации 	= Формат(ПериодРегистрации, "ДФ='MMMM yyyy'");
	
	Если Константы.УчетПоКомпании.Получить() Тогда
		
		Организация = Константы.Компания.Получить();
		Элементы.Организация.Видимость = Ложь;
		
	Иначе
		
		Организация 				= УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Справочники.Организации.ОсновнаяОрганизация);
		
	КонецЕсли;
	
	Валюта 							= Константы.ВалютаУчета.Получить();

	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить() Тогда
		
		Подразделение = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события формы ОбработкаВыбора
//
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма")
		И СтрНайти(ИсточникВыбора.ИмяФормы, "ФормаКалендаря") > 0 Тогда
		
		ПериодРегистрации = КонецДня(ВыбранноеЗначение);
		УправлениеНебольшойФирмойКлиент.ПриИзмененииПериодаРегистрации(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаВыбора()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ РЕКВИЗИТОВ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события Регулирования реквизита ПериодРегистрации.
//
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	УправлениеНебольшойФирмойКлиент.ПриРегулированииПериодаРегистрации(ЭтаФорма, Направление);
	УправлениеНебольшойФирмойКлиент.ПриИзмененииПериодаРегистрации(ЭтаФорма);
	
КонецПроцедуры //ПериодРегистрацииРегулирование()

&НаКлиенте
// Процедура - обработчик события НачалоВыбора реквизита ПериодРегистрации.
//
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка	 = Ложь;
	
	ДатаКалендаряПриОткрытии = ?(ЗначениеЗаполнено(ПериодРегистрации), ПериодРегистрации, УправлениеНебольшойФирмойПовтИсп.ПолучитьТекущуюДатаСеанса());
	
	ОткрытьФорму("ОбщаяФорма.ФормаКалендаря", УправлениеНебольшойФирмойКлиент.ПолучитьПараметрыОткрытияФормыКалендаря(ДатаКалендаряПриОткрытии), ЭтаФорма);
	
КонецПроцедуры //ПериодРегистрацииНачалоВыбора()

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	ВариантыОтчетов.ПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	
	Если НЕ ПроверитьНастройкиПочты() Тогда 
		ТекстСообщения = НСтр("ka='Сперва требуеться указать настройки почтового ящика!';ru='Сперва требуеться указать настройки почтового ящика!';en='Сперва требуеться указать настройки почтового ящика!'");
		ПолеСообщения = "НастройкиПочты";
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Отчет, ТекстСообщения,,,ПолеСообщения);
		Возврат;
	КонецЕсли;
	
	Если Константы.ИспользоватьНесколькоОрганизаций.Получить() И НЕ ЗначениеЗаполнено(Организация) Тогда
		ТекстСообщения = НСтр("ka='Не выбрана организация!';ru='Не выбрана организация!';en='Not selected organization!'");
		ПолеСообщения = "Организация";
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Отчет, ТекстСообщения,,,ПолеСообщения);
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ПериодРегистрации) Тогда
		ТекстСообщения = НСтр("ka='Не выбран период регистрации!';ru='Не выбран период регистрации!';en='Not selected registration period!'");
		ПолеСообщения = "ПериодРегистрации";
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Отчет, ТекстСообщения,,,ПолеСообщения);
		Возврат;
	КонецЕсли;

	Если НЕ Константы.ФункциональнаяУчетВалютныхОпераций.Получить() И НЕ ЗначениеЗаполнено(Валюта) Тогда
		ТекстСообщения = НСтр("ka='Не выбрана валюта!';ru='Не выбрана валюта!';en='Not selected currency!'");
		ПолеСообщения = "Валюта";
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Отчет, ТекстСообщения,,,ПолеСообщения);
		Возврат;
	КонецЕсли;
	
	ТаблицаОтправики = Новый ТаблицаЗначений;
	ТаблицаОтправики.Колонки.Добавить("Получатель");
	ТаблицаОтправики.Колонки.Добавить("ТабличныйДокумент");

	РезультатЗапроса = ВыполнитьЗапрос();

	Если РезультатЗапроса[0].Пустой() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='Нет данных для формирования отчета!';ru='Нет данных для формирования отчета!';en='No data to generate a report!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	//Макет = Отчеты.РасчетныеЛисткиСОтправкой.ПолучитьМакет("Макет");
	// Олег Литвиненко 29.06.23 --->
	ЭтотОтчет = РеквизитФормыВЗначение("Отчет");
	Макет = ЭтотОтчет.ПолучитьМакет("Макет"); 

	РегВалюта = Константы.НациональнаяВалюта.Получить();
	// Олег Литвиненко <---

	ОбластьШапка 				= Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовок 			= Макет.ПолучитьОбласть("Заголовок");
	ОбластьНачисленоУдержано 	= Макет.ПолучитьОбласть("НачисленоУдержано");
	ОбластьДетали 				= Макет.ПолучитьОбласть("Детали");
	ОбластьДоходыВыплачено 		= Макет.ПолучитьОбласть("ДоходыВыплачено");
	ОбластьДеталиВыплаты 		= Макет.ПолучитьОбласть("ДеталиВыплаты");
	ОбластьВсего 				= Макет.ПолучитьОбласть("Всего");
	// Олег Литвиненко 29.06.23 --->
	ОбластьВсегоВал				= Макет.ПолучитьОбласть("ВсегоВал");
	ОбластьВремяШапка			= Макет.ПолучитьОбласть("РабочееВремяШапка");
	ОбластьВремяСтрока			= Макет.ПолучитьОбласть("РабочееВремяСтрока");
	// Олег Литвиненко <---
	ОбластьПодвал 				= Макет.ПолучитьОбласть("Подвал");
	ОбластьОтбивка 				= Макет.ПолучитьОбласть("Отбивка");

	//ТабличныйДокумент.Очистить();
	
	// Олег Литвиненко 29.06.23 --->
	ТаблицаТабель = РезультатЗапроса[2].Выгрузить();
	СтруктураОтбораТабель = Новый Структура("Подразделение,Должность,ФизЛицо");
	// Олег Литвиненко <---

	ВыборкаПодразделение = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
	Пока ВыборкаПодразделение.Следующий() Цикл
			
		ВыборкаФизлицо = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ФизЛицо");
		Пока ВыборкаФизлицо.Следующий() Цикл
			
			НовСтрокаТабОтправки = ТаблицаОтправики.Добавить();
			
			ТабДок = Новый ТабличныйДокумент;
			
			ОбластьОтбивка.Параметры.ТекстОтбивки = Формат(ПериодРегистрации , "ДФ=""ММММ гггг 'г.' """);
			ТабДок.Вывести(ОбластьОтбивка);
			
			ОбластьОтбивка.Параметры.ТекстОтбивки = "Организация: " + Организация;
			ТабДок.Вывести(ОбластьОтбивка);
			
			//ВыборкаПодразделение = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
			//Пока ВыборкаПодразделение.Следующий() Цикл
			
			ОбластьОтбивка.Параметры.ТекстОтбивки = "Подразделение: " + ВыборкаПодразделение.Подразделение;
			ТабДок.Вывести(ОбластьОтбивка);
			//ТабДок.НачатьГруппуСтрок();
			
			ОбластьШапка.Параметры.Заголовок = "Расчетный листок за " + Формат(ПериодРегистрации , "ДФ=""ММММ гггг 'г.' """);
			ОбластьШапка.Параметры.Организация = Организация;
			ОбластьШапка.Параметры.Заполнить(ВыборкаФизлицо);
			ПредставлениеФизЛицо = УправлениеНебольшойФирмойСервер.ПолучитьФамилиюИмяОтчество(ВыборкаФизлицо.Фамилия, ВыборкаФизлицо.Имя, ВыборкаФизлицо.Отчество, Истина);
			ОбластьШапка.Параметры.ФизЛицо = ВыборкаФизлицо.Физлицо.НаименованиеНаИностранскомЯзыке;//Физлицо.НаименованиеАнглиское;//?(ЗначениеЗаполнено(ПредставлениеФизЛицо), ПредставлениеФизЛицо, ВыборкаФизлицо.Физлицо);
			ТабДок.Вывести(ОбластьШапка);
			ТабДок.Вывести(ОбластьЗаголовок);
			ТабДок.Вывести(ОбластьНачисленоУдержано);
			
			ПоследнееНачисление = ТабДок.ВысотаТаблицы;
			ПоследнееУдержание = ТабДок.ВысотаТаблицы;
			
			ВыборкаДетали = ВыборкаФизлицо.Выбрать();
			Пока ВыборкаДетали.Следующий() Цикл
				
				Если ВыборкаДетали.Удержание = NULL Тогда
					
					Если ПоследнееНачисление < ПоследнееУдержание Тогда
						
						ТабДок.Область(ПоследнееНачисление + 1, 1).Текст = ВыборкаДетали.Начисление;
						ТабДок.Область(ПоследнееНачисление + 1, 2, ПоследнееНачисление + 1, 3).Текст = "" + День(ВыборкаДетали.ДатаНачала) + "-" + День(ВыборкаДетали.ДатаОкончания) + " " + Формат(ВыборкаДетали.ДатаОкончания , "ДФ=""МММ гг""");
						ТабДок.Область(ПоследнееНачисление + 1, 4).Текст = ВыборкаДетали.ОтработаноДней;
						ТабДок.Область(ПоследнееНачисление + 1, 5).Текст = ВыборкаДетали.ОтработаноЧасов;
						//ТабДок.Область(ПоследнееНачисление + 1, 6, ПоследнееНачисление + 1, 7).Текст = ВыборкаДетали.СуммаНачислено;
						// Олег Литвиненко 17.08.23 --->
						ТабДок.Область(ПоследнееНачисление + 1, 6, ПоследнееНачисление + 1, 7).Текст = ?(ВыборкаДетали.Валюта=РегВалюта, ВыборкаДетали.СуммаНачислено, ВыборкаДетали.СуммаНачисленоВал);
						// Олег Литвиненко <---
					
					Иначе
					
						ОбластьДетали.Параметры.Начисление = СтрШаблон("%1, %2", ВыборкаДетали.Начисление, ВыборкаДетали.ВалютаПредставление);
						ОбластьДетали.Параметры.ПериодНачисление = "" + День(ВыборкаДетали.ДатаНачала) + "-" + День(ВыборкаДетали.ДатаОкончания) + " " + Формат(ВыборкаДетали.ДатаОкончания , "ДФ=""МММ гг""");
						ОбластьДетали.Параметры.ОтработаноДнейНачисление = ВыборкаДетали.ОтработаноДней;
						ОбластьДетали.Параметры.ОтработаноЧасовНачисление = ВыборкаДетали.ОтработаноЧасов;
						ОбластьДетали.Параметры.СуммаНачислениеВал = ВыборкаДетали.СуммаНачисленоВал;
						
						ТабДок.Вывести(ОбластьДетали);
						
						ОбластьДетали.Параметры.Начисление = Справочники.ВидыНачисленийИУдержаний.ПустаяСсылка();
						ОбластьДетали.Параметры.ПериодНачисление = "";
						ОбластьДетали.Параметры.ОтработаноДнейНачисление = 0;
						ОбластьДетали.Параметры.ОтработаноЧасовНачисление = 0;
						ОбластьДетали.Параметры.СуммаНачислениеВал = 0;
					
					КонецЕсли; 
					
					ПоследнееНачисление = ПоследнееНачисление + 1;
					
				Иначе
					
					Если ПоследнееУдержание < ПоследнееНачисление Тогда
					
						ТабДок.Область(ПоследнееУдержание + 1, 8, ПоследнееУдержание + 1, 10).Текст = ВыборкаДетали.Удержание;	
						ТабДок.Область(ПоследнееУдержание + 1, 11, ПоследнееУдержание + 1, 12).Текст = "" + День(ВыборкаДетали.ДатаНачала) + "-" + День(ВыборкаДетали.ДатаОкончания) + " " + Формат(ВыборкаДетали.ДатаОкончания , "ДФ=""МММ гг""");
						ТабДок.Область(ПоследнееУдержание + 1, 13, ПоследнееУдержание + 1, 14).Текст = ВыборкаДетали.СуммаУдержано;
					
					Иначе
					
						ОбластьДетали.Параметры.Удержание = ВыборкаДетали.Удержание;
						ОбластьДетали.Параметры.ПериодУдержание = "" + День(ВыборкаДетали.ДатаНачала) + "-" + День(ВыборкаДетали.ДатаОкончания) + " " + Формат(ВыборкаДетали.ДатаОкончания , "ДФ=""МММ гг""");
						ОбластьДетали.Параметры.СуммаУдержаниеВал = ВыборкаДетали.СуммаУдержаноВал;
						
						ТабДок.Вывести(ОбластьДетали);
						
						ОбластьДетали.Параметры.Удержание = Справочники.ВидыНачисленийИУдержаний.ПустаяСсылка();
						ОбластьДетали.Параметры.ПериодУдержание = "";
						ОбластьДетали.Параметры.СуммаУдержаниеВал = 0;
					
					КонецЕсли; 
					
					ПоследнееУдержание = ПоследнееУдержание + 1;
					
				КонецЕсли; 
				
			КонецЦикла;
			
			ОбластьВсего.Параметры.ВсегоНачисления = ВыборкаФизлицо.СуммаНачислено;
			ОбластьВсего.Параметры.ВсегоУдержания = ВыборкаФизлицо.СуммаУдержано;
			// Олег Литвиненко 29.06.23 --->
			ОбластьВсегоВал.Параметры.Валюта = ВыборкаФизлицо.ВалютаПредставление;
			ОбластьВсегоВал.Параметры.ВсегоНачисленияВал = ВыборкаФизлицо.СуммаНачисленоВал;
			//ОбластьВсегоВал.Параметры.ВсегоУдержанияВал = ВыборкаФизлицо.СуммаУдержаноВал;
			Если Не ВыборкаФизлицо.Валюта = РегВалюта Тогда
				ТабДок.Вывести(ОбластьВсегоВал);
			КонецЕсли;
			// Олег Литвиненко <---
			ТабДок.Вывести(ОбластьВсего);
			
			Если Ложь Тогда // Выключено по просьбе Giorgi Sigua
				ТабДок.Вывести(ОбластьДоходыВыплачено);
				ВыборкаВыплатСотрудника		= РезультатЗапроса[1].Выбрать();
				
				СтруктураПоискиПоВыборкей	= Новый Структура("Сотрудник", ВыборкаФизлицо.Физлицо);
				Пока ВыборкаВыплатСотрудника.НАйтиСледующий(СтруктураПоискиПоВыборкей) Цикл
					
					//ОбластьДеталиВыплаты.Параметры.Заполнить(ВыборкаВыплатСотрудника);
					// Олег Литвиненко 29.06.23 --->
					Если Не РегВалюта = ВыборкаФизлицо.Валюта Тогда
						ОбластьДеталиВыплаты.Параметры.СуммаВыплаты	= ВыборкаВыплатСотрудника.СуммаВыплатыВал;
					
						ОбластьДеталиВыплаты.Параметры.ТекстВыплаты = "" + ВыборкаВыплатСотрудника.ПредставлениеДокумента + ?(ВыборкаВыплатСотрудника.ПризнакАванса, "(аванс) №", " №") + 
																		СокрЛП(ВыборкаВыплатСотрудника.Номер) + " от " + Формат(ВыборкаВыплатСотрудника.Дата, "ДФ=dd.MM.yyyy") + ", "+ ВыборкаФизлицо.ВалютаПредставление;
						ОбластьДеталиВыплаты.Параметры.ПериодВыплат		= "" + День(ПериодРегистрации) + "-" + День(КонецМесяца(ПериодРегистрации)) + " " + Формат(КонецМесяца(ПериодРегистрации) , "ДФ=""МММ гг""");
						
						ТабДок.Вывести(ОбластьДеталиВыплаты);
					КонецЕсли;
					// Олег Литвиненко <---
					
					ОбластьДеталиВыплаты.Параметры.СуммаВыплаты	= ВыборкаВыплатСотрудника.СуммаВыплаты;
					
					ОбластьДеталиВыплаты.Параметры.ТекстВыплаты = "" + ВыборкаВыплатСотрудника.ПредставлениеДокумента + ?(ВыборкаВыплатСотрудника.ПризнакАванса, "(аванс) №", " №") + 
																	СокрЛП(ВыборкаВыплатСотрудника.Номер) + " от " + Формат(ВыборкаВыплатСотрудника.Дата, "ДФ=dd.MM.yyyy") + ", "+ РегВалюта;
					ОбластьДеталиВыплаты.Параметры.ПериодВыплат		= "" + День(ПериодРегистрации) + "-" + День(КонецМесяца(ПериодРегистрации)) + " " + Формат(КонецМесяца(ПериодРегистрации) , "ДФ=""МММ гг""");
					
					ТабДок.Вывести(ОбластьДеталиВыплаты);
					
				КонецЦикла;
				
				ОбластьПодвал.Параметры.СуммаДолгНаНачалоПериода = ВыборкаФизлицо.СальдоНаНачало;
				
				Если ВыборкаФизлицо.СальдоНаНачало < 0 Тогда
					ОбластьПодвал.Параметры.ТекстДолгНаНачалоПериода = "Долг за работником на начало месяца:";
				Иначе	
					ОбластьПодвал.Параметры.ТекстДолгНаНачалоПериода = "Долг за организацией на начало месяца:";
				КонецЕсли; 
			
			КонецЕсли;
			
			ОбластьПодвал.Параметры.СуммаДолгНаКонецПериода = ВыборкаФизлицо.СальдоНаКонец;
			Если ВыборкаФизлицо.СальдоНаКонец < 0 Тогда
				ОбластьПодвал.Параметры.ТекстДолгНаКонецПериода = "Долг за работником на конец месяца:";
			Иначе	
				ОбластьПодвал.Параметры.ТекстДолгНаКонецПериода = "Долг за организацией на конец месяца:";
			КонецЕсли; 
			ТабДок.Вывести(ОбластьПодвал);
			
			Если Ложь Тогда // Выключено по просьбе Giorgi Sigua
				// Олег Литвиненко 29.06.23 --->
				ЗаполнитьЗначенияСвойств(СтруктураОтбораТабель, ВыборкаФизлицо);
				МассивСтрокТабеля = ТаблицаТабель.НайтиСтроки(СтруктураОтбораТабель);
				Если МассивСтрокТабеля.Количество()>0 Тогда
					ТабДок.Вывести(ОбластьВремяШапка);
					Для Каждого ТекСтр Из МассивСтрокТабеля Цикл
						ОбластьВремяСтрока.Параметры.Заполнить(ТекСтр);
						ТабДок.Вывести(ОбластьВремяСтрока);
					КонецЦикла;
				КонецЕсли;
				// Олег Литвиненко <---
			КонецЕсли;
			
			ВидКИ = Справочники.ВидыКонтактнойИнформации.EmailФизическиеЛица;
			ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			
			КонтактнаяИнформацияСотрудника = ВыборкаФизлицо.Физлицо.Физлицо.КонтактнаяИнформация;
			ПоискМейла = КонтактнаяИнформацияСотрудника.НайтиСтроки(Новый Структура("Вид, Тип", ВидКИ, ТипКИ));
			
			Если ПоискМейла.Количество() > 0 Тогда 
				НовСтрокаТабОтправки.Получатель = ?(ЗначениеЗаполнено(ПоискМейла[0].АдресЭП), ПоискМейла[0].АдресЭП, ПоискМейла[0].Представление);
			КонецЕсли;
			НовСтрокаТабОтправки.ТабличныйДокумент = ТабДок;        
				
		КонецЦикла;
		
		//ТабДок.ЗакончитьГруппуСтрок();
		
		//НовСтрокаТабОтправки.Получатель = 
	КонецЦикла;
	
	ПодготовитьОтпраивтьПисьма(ТаблицаОтправики)
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНастройкиПочты()

	МожноОтправлять = Истина;
	УстановитьПривилегированныйРежим(Истина);
	ХЗНастройкиОбмена = Константы.НастройкиДляОтправкиОтчетов.Получить();
	УстановитьПривилегированныйРежим(Истина);
	Если ХЗНастройкиОбмена <> Неопределено И ТипЗнч(ХЗНастройкиОбмена) = Тип("ХранилищеЗначения") Тогда
	
		НастройкиОбмена = ХЗНастройкиОбмена.Получить();
		Если ТипЗнч(НастройкиОбмена) = Тип("Структура") Тогда
		
			Если НЕ ЗначениеЗаполнено(НастройкиОбмена.ИмяСервераSMTP) 
				ИЛИ НЕ ЗначениеЗаполнено(НастройкиОбмена.ЛогинSMTP)
				ИЛИ НЕ ЗначениеЗаполнено(НастройкиОбмена.ПарольSMTP) Тогда 
				
				МожноОтправлять = Ложь;
				
			КонецЕсли;
		
		КонецЕсли; 
	
	КонецЕсли;	

	Возврат МожноОтправлять;
	
КонецФункции // ()

&НаСервере
Процедура ПодготовитьОтпраивтьПисьма(ТаблицаОтправики)
	
	Для Каждого Строк Из ТаблицаОтправики Цикл
		
		Если НЕ ЗначениеЗаполнено(Строк.Получатель) Тогда 
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.ОтправкаОтчетаНаЭлектроннуюПочту.СоздатьМенеджерЗаписи();
	
		МенеджерЗаписи.ПолучательМейл = Строк.Получатель;
		МенеджерЗаписи.ИмяОтчета = "РасчетныеЛисткиСОтправкой";
		МенеджерЗаписи.ВложеныйФайл = Новый ХранилищеЗначения(Строк.ТабличныйДокумент);

		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	РегЗадание = РегламентныеЗадания.НайтиПредопределенное("ОтправкаПисемСОтчетами");
	
	Если НЕ РегЗадание.Использование Тогда 
		РегЗадание.Использование = Истина;
		РегЗадание.Записать();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПочты(Команда)
	ОткрытьФорму("Отчет.РасчетныеЛисткиСОтправкой.Форма.ФормаНастройкиСоединения");
КонецПроцедуры
